openfoam/tutorials/heatTransfer/chtMultiRegionFoam/windshieldDefrost/0.orig/ice/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 260;

boundaryField
{
    symmetry
    {
        type            symmetryPlane;
    }

    walls
    {
        type            zeroGradient;
    }

    ice_to_cabin
    {
        type            compressible::turbulentTemperatureRadCoupledMixed;
        value           uniform 260;
        Tnbr            T;
        kappaMethod     fluidThermo;
        kappa           none;
    }

    ice_to_exterior
    {
        type            compressible::turbulentTemperatureRadCoupledMixed;
        value           uniform 260;
        Tnbr            T;
        kappaMethod     fluidThermo;
        kappa           none;
    }
}


// ************************************************************************* //
